//===================================================================================================
// Summary:
//		
// Date:
//		2008-12-3
// Author:
//		Yang Xuefeng (yang_xuefeng@founder.com.cn)
//===================================================================================================

#ifndef __Bp_XMLCodec_Export_XMLCodec__
#define __Bp_XMLCodec_Export_XMLCodec__

//===================================================================================================

#include "BpXMLDocument.h"
#include "BpXMLNode.h"

//===================================================================================================

// 错误类型定义
#define XML_OK						0					// 成功
#define XML_ERROR					1					// 失败
#define XML_CL_UNEXPECTED			2					// 无法预知的失败
#define XML_INITXMLDOM_ERROR		100					// 初始化XML DOM失败
#define XML_FILE_CREATE_ERROR		101					// XML文件创建错误
#define XML_FILE_OPEN_ERROR			102					// XML文件打开错误
#define XML_FILE_SAVE_ERROR			103					// XML文件保存错误
#define XML_ADDNODE_ERROR			104					// XML文件加结点错误
#define XML_ADDCHILDNODE_ERROR		105					// XML文件加子结点错误

// 最大字符长度
#define BP_MAX_FILELEN		256;

//===================================================================================================

//------------------------------------------------------------------------------------------------
// Summary:
// 		XML库初始化函数.
// Remarks:
//		必须和UnInitXMLCodec配对使用。
//------------------------------------------------------------------------------------------------
bool InitXMLCodec();

//------------------------------------------------------------------------------------------------
// Summary:
// 		XML库释放操作.
// Remarks:
//		必须和UnInitXMLCodec配对使用。
//------------------------------------------------------------------------------------------------
bool UnInitXMLCodec();

//------------------------------------------------------------------------------------------------
// Summary:
// 		创建XML文件解析器对象。
// Remarks:
//		必须和DestroyXMLParser配对使用。
//------------------------------------------------------------------------------------------------
IBpXMLDocument *CreateXMLDocument();

//------------------------------------------------------------------------------------------------
// Summary:
// 		释放XML文件的Document对象。
//------------------------------------------------------------------------------------------------
bool DestroyXMLDocument(IBpXMLDocument *pBpXMLDocument);

//------------------------------------------------------------------------------------------------
// Summary:
// 		释放XML文件的节点器对象。
//------------------------------------------------------------------------------------------------
bool DestroyXMLNode(IBpXMLNode *pBpXMLNode);

//===================================================================================================

#endif // #ifndef __Bp_XMLCodec_Export_XMLParser__